/*
 void setup() {
size(960, 480);  //Пример 5-6: Рисуем непрерывные линии
strokeWeight(4);
smooth();
stroke(0, 102);
}
void draw() {
line(mouseX  , mouseY ,  pmouseX, height - pmouseY);
//Переменные  pmouseX и pmouseY 
//сохраняют позицию из предыдущего кадра. Они обновляются при каждом запуске 
//блока команд из draw().
//Сохраняя текущее и предыдущее положение курсора , можно рисовать непрерывную линию
}
*/

void setup() { // пример 5-7 
// Переменные pmouseX и pmouseY можно использовать для вычисления скорости
// перемещения мыши.
size(480, 120);
smooth();
stroke(0, 102);
}
void draw() {
float weight = dist(mouseX, mouseY, pmouseX, pmouseY);
// Тип double в два раза больше чем float.
//Поэтому double известен как число с двойной точностью,
//а float – как число с одинарной точностью.

// переменной float weight присвоена  функция dist() которая измеряет растояние 
// между текущей позицией мыши и предыдущим положением появляется зависимость 
// толщены от скорости и эту переменную передаем .. 
strokeWeight(weight); //..в качестве параметра в функции strokeWeight(weight);
line(mouseX, mouseY, pmouseX, pmouseY); // Здесь скорость движения мыши устанавливат 
                                        // толщину проводимой линии
}
