//---------- Пример 6-8: Сохраняем текст в формате String--------
PFont font;
String quote = "That’s one small step for man...";

void setup() {
  size(480, 120);
  font = createFont("SourceCodePro-Regular.ttf", 24);
  textFont(font);
}

void draw() {
  background(102);
  text(quote, 26, 24, 240, 100);
}
/*
 Чтобы сделать код более компактным, мы сохраним этот текст в переменной. 
 Текстовые данные сохраняются в формате String. Вот обновленная версия предыдущего
примера с использованием формата String: (Пример 6-7: 
Записываем текст в прямоугольнике)sketch 221212amedia

Существует несколько дополнительных функций для отображения букв на
экране. В справке Processing, в разделе Typography, они описаны с примерами.
*/
