////4/Переменные
////Переменные сохраняют свое значение в
//памяти и поэтому могут быть использованы
//в программе неоднократно. Переменная
//может использоваться в одной программе
//много раз и изменять свое значение во
//время выполнения программы.

//size(480, 120); //Пример 4-1: Повторное использование значений
//smooth();
//int y = 100;
//int d = 130;     //Пример 4-2: Изменяем значение переменной
//ellipse(75, y, d, d); // Левый
//ellipse(175, y, d, d); // Центральный
//ellipse(275, y, d, d); // Правый

//Пример 4-3: Корректируем размер окна
size(480, 960);
smooth();
line(0, 0, width, height); // Линия от (0,0) до (480,120)
line(width, 0, 0, height); // Линия от (480,0) до (0,120)
ellipse(width/2, height/2, 60, 60);

int hw = 25;
ellipseMode(CENTER);
fill(50);
ellipse(width/2, height/2, hw, hw); 
