// Пример 5-19: Рисуем буквы

/*
В отличие от переменной keyPressed, которая меняет свое значение на ложь,
всегда, когда клавиша отжата, переменная key сохраняет свое значение до тех
пор, пока не будет нажата следующая клавиша. В следующем примере мы
используем переменную key, чтобы изображать на экране символы. Каждый
раз, когда вы будете нажимать клавишу, значение переменной будет
обновляться и вы увидите новый символ. Некоторые клавиши, вроде Shift и
Alt, не имеют видимого символа, и когда вы нажмете их, вы ничего не увидите
*/

/*
Этот пример вводит функцию textSize(), для установки размера букв, textAlign()
для расположения букв по центру и функцию text() для рисования букв. Мы
обсудим эти функции подробнее на страницах 84-85.
*/

//void setup(){
//  size(120,120);
//  textSize(64);
//  textAlign(CENTER);
//}


//void draw(){
//  background(0);
//  text(key, 60,80);
//}

/*
Мы можем проверить, какая клавиша нажата, с помощью оператора if и
нарисовать что-либо на экране в соответствии этой буквой.
*/

// Пример 5-20: Проверяем нажатие клавиш

//void setup(){
//  size (120, 120);
//  smooth();
//}

//void draw(){
//  background(204);
//  if (keyPressed){
//    if((key == 'h') || (key == 'H')) {
//      line(30, 60, 90, 60);
//    }
//    if((key == 'n')||(key == 'N')) {
//      line(30, 20, 90, 100);
//    }
//  }
//  line(30, 20, 30, 100);
//  line(90, 20, 90, 100);
//}

/*
Во время нажатия клавиш H или N Caps Lock может находиться в активном
состоянии или может удерживаться клавиша Shift, поэтому программа должна
проверять нажатие строчной и прописной вариантов этих букв. Мы
скомбинируем два этих теста в один логическим ИЛИ, символом ||. Проще
говоря, оператор if ставит условие: “Если нажата клавиша ‘h’ или если нажата
клавиша ‘H'. В отличие от логического И (символа &&) из примера 5-17, одного
инстинного выражения достаточно, чтобы все выражение было истинным.
*/

/*
С клавишами, которые не связаны с определенной буквой (CODED), работать
сложнее. Клавиши типа Shift, Alt, стрелок требуют дополнительных действий.
Во-первых, мы должны проверить, связана ли клавиша с определенной
буквой, а затем с помощью переменной keyCode проверить, какая это
клавиша. Чаще всего используются клавиши ALT, СONTROL и SHIFT, а также
стрелки - UP, DOWN, LEFT и RIGHT.
*/

// Пример 5-21: Управляем движение стрелками
int x = 215;

void setup (){
  size(480,120);
}

void draw(){
  if (keyPressed &&(key == CODED)){ 
    if (keyCode == LEFT){
      x--;
    }else if(keyCode == RIGHT){
      x++;
    }
  }
  rect(x, 45, 50, 50);
}
