size(480, 120); //Пример 3-11: Сглаживаем линии // Пример 3-12: Устанавливаем толщину линий.
smooth(); // Включаем сглаживание
//ellipse(140, 60, 90, 90);
//noSmooth(); // Выключаем сглаживание
//ellipse(240, 60, 90, 90);
// сглаживание либо включено либо выключено можно использовать только раз в скетче
ellipse(75, 60, 90, 90);
strokeWeight(8); // Расширяем линию до 8 пикселей // толшина обводки
ellipse(175, 60, 90, 90);
ellipse(279, 60, 90, 90);
strokeWeight(20); // Расширяем линию до 20 пикселей // толшина обводки
ellipse(389, 60, 90, 90);
