//Пример 5-11: Преобразуем диапазон с функцией map()
// Функция map() : Она преобразует диапазон значений переменной.
// Все вычисления скрыты в функции map().
/*
Функция map() делает код легко читаемым, поскольку минимальное и
максимальное значения заданы явно в качестве входных параметров. В
приведенном примере диапазон mouseX от 0 до width преобразован в
60 Учимся программировать вместе с Processing
диапазон от 60 (когда mouseX = 0) до 180 (когда mouseX=width).
*/

void setup() {
size(240, 120);
strokeWeight(12);
smooth();
}
void draw() {
background(204);
stroke(255);
line(120, 60, mouseX, mouseY); // Белая линия
stroke(0);
float mx = map(mouseX, 0, width, 60, 180); //Первый параметр - переменная, 
//второй и третий - минимальное и максимальное значение переменной,
// четвертое и пятое - желаемое минимальное и максимальное значение переменной.

line(120, 60, mx, mouseY); // Черная линия
}
