//-----------Пример 6-1: Загружаем изображение------------
/*
Изображения
 Перед тем, как вы выведете изображение на экран, вам следует
 выполнить несколько действий:
 1. Добавьте изображение в папку data (см. инструкцию выше).
 2. Объявите переменную PImage для хранения изображения.
 3. Загрузите изображение в переменную функцией loadImage().
 */

/*
После выполнения указанных трех шагов, вы сможете вывести на экран
 изображение с помощью функции image(). Первый параметр функции image()
 указывает нужное изображение, второй и третий x- и y-координаты
 */
//PImage img;

//void setup() {
//  size(480, 120);
//  img = loadImage("lunar.jpg");
//}

//void draw() {
//  image(img, 0, 0); // Дополнительные четвертый и пятый параметры устанавливают ширину и
//  //высоту изображения. Если не указаны четвертый и пятый параметры
//  //изображения, ширина и высота изображения не изменятся.
//}

//--------------Пример 6-2: Загружаем несколько изображений----------
//PImage img1;
//PImage img2;

//void setup() {
//  size(480, 120);
//  img1 = loadImage("lunar.jpg");
//  img2 = loadImage("capsule.jpg");
//}

//void draw() {
//  image(img1, -120, 0);
//  image(img1, mouseX , mouseY, 240, 120);
//  image(img2, 300, 0, 240, 120);
//}
//----------------Пример 6-4: Прозрачность в GIF------------

//PImage img;

//void setup(){
//  size(480, 120);
//  img = loadImage("clouds.gif");
//}

//void draw(){
//  background(255);
//  image(img, 0, 0);
//  image(img, 0, mouseY * -1);
//}

//------------Пример 6-5: Прозрачность в PNG-------

//PImage img;

//void setup(){
//  size(480, 120);
//  img = loadImage("clouds.png");
//}

//void draw(){
//  background(204);
//  image(img, 0, 0);
//  image(img, 0, mouseY * -1);
//}

//----------------Шрифты------------

/*
1. Добавьте шрифт в папку data .
2. Объявите переменную PFont для хранения шрифтов.
3. Загрузите шрифт в переменную с помощью функции loadFont().
4. Установите текущий шрифт командой textFont().
*/


/*
PFont - это класс шрифтов для обработки.
Чтобы создать шрифт для использования при
обработке, выберите "Создать шрифт..." в меню Сервис.
Это создаст шрифт в формате, который требуется для обработки,
а также добавит его в каталог данных текущего эскиза. 
Обработка отображает шрифты, использующие формат шрифта .vlw,
который использует изображения для каждой буквы, 
а не определяет их с помощью векторных данных.
Функция loadFont() создает новый шрифт, а функция TextFont()
делает шрифт активным. Метод list() создает список шрифтов, 
установленных на компьютере, который является полезной информацией
для использования сФункция CreateFont() для динамического преобразования
шрифтов в формат, используемый при обработке.

Чтобы создать новый шрифт динамически, 
используйте функцию CreateFont(). 
Не используйте синтаксис new PFont().
*/

/*
Теперь, с помощью функции text() вы можете изобажать буквы на экране, а с
функцией textSize() менять размер шрифта. В этом примере вам потребуется
применить инструмент Create Tool для создания VLW-шрифта (и изменить строчку
loadFont(), чтобы использовать его) или использовать AndaleMono-36.vlw из
папки media
*/
//PFont font;

//void setup() {
//  size(480, 120);
//  font = createFont("SourceCodePro-Regular.ttf", 32); // 32- это размер символов
//  textFont(font);
//}

//void draw() {
//  background(102);
//  textSize(32);
//  text("That’s one small step for man...", 25, 60);
//  textSize(16);
//  text("That’s one small step for man...", mouseX, mouseY);
//}
/*
Первый параметр функции text() - это текст, который вы хотите написать на
экране. (Заметьте, что символы заключены в кавычки.) Второй и третий
параметр определяют положение по горизонтали и по вертикали. Положение
задается относительно основной линии текста (см. рис. 6-2).
*/

//size(400, 400);
//PFont font;
//// The font must be located in the sketch's 
//// "data" directory to load successfully
//font = createFont("Kontora-48.vlw", 128);
//textFont(font);
//text("word", 100, 100);


// list()  Возвращает список шрифтов, установленных в системе

//----------Пример 6-7: Записываем текст в прямоугольнике-----

// text("That’s one small step for man...", 26, 30, 240, 100);

//Добавьте четвертый и пятый параметры, чтобы записать текст в прямоугольник с
//определенной длиной и шириной:

PFont font;
void setup() {
size(480, 120);
font = loadFont("Roboto-Regular-48.vlw");
textFont(font);
}
void draw() {
background(102);
textSize(36);
text("Андромедос...", 26, 30, mouseX, 100);
}
