/*
Код, который взаимодействует с мышью,
клавиатурой и другими устройствами должен
выполняться непрерывно. Чтобы это стало
возможным, включите фрагмент кода,
который должен повторяться непрерывно, в
функцию draw().
*/
//Пример 5-1: Функция draw()
//void draw() {
//// Выводит на консоль номер кадра
//println("I’m drawing");
//println(frameCount);
//}

///* Код, записанный в блоке draw(), выполняется сверху вниз, а затем
//повторяется до тех пор, пока вы не выйдете из программы, нажав кнопку Stop
//или закрыв окно. Каждый “прогон” кода в функции draw() называется кадр
//(frame). (По умолчанию, частота “прогонов” кода равна 60 кадров в секунду,
//но вы можете установить другое значение. Мы сделаем это в примере 7-2.)
//Функция println() в предыдущем примере выводит текст “I’m drawing” и номер
//кадра с помощью специальной переменной frameCount (1, 2, 3, ...). Текст
//появляется в консольном окне - область с черным фоном под текстовым
//редактором Processing.*/

void setup() {
println("I’m starting");
}
void draw() {
println("I’m running");
}

/*
В типичной программе код внутри функции setup() используется для задания
начальных значений переменных. Первая строка - это, как правило, функция
size(), далее могут быть включены функции, задающие цвета заливки и линий
или функции для загрузки изображений и шрифтов. (Если вы не включите
функцию size(), окно будет иметь размер 100x100 пикселей.)
*/
