// Пример 5-13: Определяем, нажата ли кнопка

/*
Оператор if позволяет вам выбирать, запускать определенный блок кода или нет.
Вы можете расширить возможности оператора if, добавив к нему else для выбора
между двумя блоками кода. Если выражение test в операторе if является ложным,
запускается блок else. Например, вы можете сделать цвет линий белым, когда
кнопка мыши нажата и черным, когда отжата:
*/

/*
void setup() {
  size(240, 120);
  smooth();
  strokeWeight(30);
}
void draw() {
  background(204);
  stroke(102);
  line(40, 0, 70, height);
  if (mousePressed) {
  stroke(0);
  } else {
  stroke(255);
  }
  line(0, 70, width, 50);
}
*/

//Пример 5-14: Работаем со всеми кнопками мыши

/*
Processing имеет возможность отслеживать, какая кнопка нажата, если на вашей
мыши более одной кнопки. Переменная mouseButton принимает три значения:
LEFT, CENTER и RIGHT. Используйте оператор сравнения ==, чтобы определить,
какая из кнопок нажата:
*/

void setup() {
  size(120, 120);
  smooth();
  strokeWeight(30);
}
void draw() {
  background(204);
  stroke(102);
  line(40, 0, 70, height);
  if (mousePressed) {
    if (mouseButton == LEFT) { // Переменная mouseButton принимает три значения:
                                //LEFT, CENTER и RIGHT.
      stroke(255);
    } else {
      stroke(0);
    }
    line(0, 70, width, 50);
  }
}

/*
 Операторы могут образовывать длинную
цепочку, каждое звено которой проверяет какое-либо условие, а также одни
блоки if могут входить в другие блоки if для реализации сложных условий.
*/
