//Пример 5-15: Найди курсор

/**
Программа в этом примере определяет, где находится курсор - справа или слева
от линии, а затем двигает линию в направлении курсора:
*/

float x;
int offset = 10;

void setup() {
  size(240, 120);
  smooth();
  x = width/2;
}

void draw() {
  background(204);
    if (mouseX > x) {
      x += 0.5;
      offset = -10;
    }
  if (mouseX < x) {
    x -= 0.5;
    offset = 10;
}

line(x, 0, x, height);
line(mouseX, mouseY, mouseX + offset, mouseY - 10);
line(mouseX, mouseY, mouseX + offset, mouseY + 10);
line(mouseX, mouseY, mouseX + offset*3, mouseY);
}

/**
Чтобы писать программы, имеющие графический интерфейс пользователя
(кнопки, полосу прокрутки, флажки и т.д.), необходимо написать код, который
знает, когда курсор находится в определенной области экрана. Следующие два
примера показывают, как проверить, находится курсор в пределах круга или
прямоугольника, или нет. Код составлен из отдельных модулей с переменными,
поэтому вы сможете использовать его для проверки любого круга или
прямоугольника просто заменив несколько величин.
*/
