//// Пример 4-7: Прокачаем цикл for
//size(480, 240);
//smooth();
//strokeWeight(2);
//for (int i = 20; i < 400; i += 8) {
//line(i, 40, i + 60, 80);
//}
//for (int i = 20; i < 400; i +=8){
//line(i, 120, i + 60, 80);
//}
///*________________*/
//// конечная точка y координата +80
//for (int i = 20; i < 400; i +=8){
//line(i, 120, i + 60, 160);
//}
//// начальная точка y координата +80
//for (int i = 20; i < 400; i +=8){
//line(i, 200, i + 60, 160);
//}
//// завернуть в параметризированный метод

//Пример 4-8: Линии, исходящие из центра

//size(480, 120);
//smooth();
//strokeWeight(2);
//for (int i = 20; i < 400; i += 20) {
//line(i, 0, i + i/2, 80);
//}

// Пример 4-9: Изгибаем линии
//size(480,480);
//smooth();
//strokeWeight(2);
//for (int i = 20; i < 400; i += 20) {
//line(i, 0, i + i/2, 80);
//line(i + i/2, 80, i*1.2, 160);
////___________добавил еще линий________________________
//line(i*1.2 , 160, i + i/2, 240);
//}

// Пример 4-10: Вложенные циклы
size(480, 120);
background(0);
smooth();
stroke(4);
for (int y = 0; y <= height; y += 40) { // с каждым шагом цикла получаем значение y
   for (int x = 0; x <= width; x += 40) { // получая значение y совершается шаг вложенного цикла
                                         // и получаем значение x
      fill(255, 140);
      //ellipse(x, y, 40, 40);
      // поменял круги на треугольники
      int x2 = x + 20;
      int y2 = y + 20;
      int y3 = y + 40;
      triangle(x, y, x2, y2, x, y3);
    }
}
