size(800,600); // размер окна
//point(240,120); //Пример 3-2: Рисуем точку
line(240,120,340,220);//Пример 3-3: Рисуем линию
rect(10,10,150,150);           //Пример 3-9: Соблюдаем последовательность
ellipse(278, -100, 400, 400); // эллипс поверх прямоугольника
                              //потому что написан после!
triangle(347, 54, 392, 9, 392, 66);
quad(158, 55, 199, 14, 392, 66, 351, 107);
ellipse(412, 60, 18, 18);//Пример 3-6: Рисуем эллипс
/*Пример 3-7: Рисуем часть эллипса
arc(190, 260, 80, 80, 0, HALF_PI);
arc(290, 260, 80, 80, 0, PI+HALF_PI);
arc(390, 260, 80, 80, PI, TWO_PI+HALF_PI);
arc(490, 260, 80, 80, QUARTER_PI, PI+QUARTER_PI);
*/
// х горизонталь y вертикаль

//size(480, 120);
//----------------Пример 3-8: Используем градусы-------------
arc(90, 460, 80, 80, 0, radians(90));
arc(190, 460, 80, 80, 0, radians(270));
arc(290, 460, 80, 80, radians(180), radians(450));
arc(390, 460, 80, 80, radians(45), radians(225));
