PImage img;
void setup() {
  size(600,600);
  img = loadImage("img.jpg");
}

void draw() {
  background(0);
  tint(255,random(255),mouseY);
  image(img,0,0,mouseX,mouseY);
}
/*
оттенок()------tint()
*/
/*Задает значение заливки для отображения изображений.
Изображения можно окрасить в определенные цвета или 
сделать прозрачными, добавив значение альфа.

Чтобы применить прозрачность к изображению, не влияя на 
его цвет, используйте белый цвет в качестве оттенка и 
укажите альфа-значение. Например, оттенок (255, 128) 
сделает изображение прозрачным на 50% (при условии, что 
альфа-диапазон по умолчанию равен 0-255, который можно 
изменить с помощью colorMode()).

При использовании шестнадцатеричной системы счисления для 
указания цвета используйте "#" или "0x" перед значениями
(например, #CCFFAA или 0xFFCCFFAA). Синтаксис # использует
шесть цифр для указания цвета (так же, как цвета обычно 
указываются в HTML и CSS). При использовании шестнадцатеричной
системы счисления, начинающейся с "0x", шестнадцатеричное 
значение должно состоять из восьми символов; первые два символа 
определяют альфа-компонент, а остальные определяют 
красный, зеленый и синий компоненты.

Значение параметра gray должно быть меньше или равно текущему
максимальному значению, указанному в colorMode(). Максимальное 
значение по умолчанию равно 255.

Функция tint() также используется для управления окраской текстур в 3D.
*/

/*
------Синтаксис
tint(rgb)  
tint(rgb, alpha)  
tint(gray)  
tint(gray, alpha)  
tint(v1, v2, v3)  
tint(v1, v2, v3, alpha)
*/

/*
Параметры
rgb     (int)  значение цвета в шестнадцатеричной системе счисления
alpha   (float)  непрозрачность изображения
gray    (float)  задает значение между белым и черным
v1      (float)  значение красного или оттенка (в зависимости от 
                текущего цветового режима)
v2      (float)  значение зеленого или насыщенности (в зависимости
                от текущего цветового режима)
v3      (float)  значение синего или яркости (в зависимости от 
                текущего цветового режима)
*/
