/*
Теперь вы знаете как использовать setup() и draw(), но это еще не все. Есть еще
одна область в текстовом редакторе, куда вы можете вписывать код - это
область вне функций setup() и draw(), где вы можете объявлять переменные.
Переменная, объявленная в функции setup(), не может быть использована где-
то еще. Переменная, объявленная вне этих функций, называется глобальной
переменной, потому что она может быть использована в любом месте
программы (”глобально”). Для пояснения приведем последовательность, в
которой работает код:
1. Объявляются переменные вне функция setup() и draw().
2. Код внутри функции setup() запускается один раз.
3. Код внутри функции draw() работает непрерывно. в цикле повторяется снеова и снова
*/

// Пример 5-3: setup() и draw()
//int x = 280;
//int y = -100;
//int diameter = 380;
//void setup() {
//size(480, 120);
//smooth();
//fill(102);
//}
//void draw() {
//background(204);
//ellipse(x, y, diameter, diameter);
//}

/*
Теперь у нас есть код, который работает непрерывно, и значит мы можем
получать информацию о местоположении мыши и с помощью этих
координат перемещать элементы на экране
*/

// Пример 5-4: Следим за курсором

//void setup() {
//size(480, 120);
//fill(0, 102);
//smooth();
//noStroke();
//}

//void draw() {
//ellipse(mouseX, mouseY, 9, 9); } // Переменная mouseX содержит x-координату,
//                             //а переменная mouseY содержит y-координату мыши:
///*
//В этом примере каждый раз, когда выполняется блок команд из функции
//draw(), в окне рисуется новый круг. Изображение выше получено
//перемещением мыши. Круги являются полупрозрачными, и по тому, где
//черный цвет наиболее интенсивен, можно понять, где курсор находился
//дольше и где он двигался с меньшей скоростью. Там, где расстояние между
//кругами больше, курсор перемещался быстрее.
//*/

// Пример 5-5: Точка следует за курсором
 void setup(){
 size(480, 120);
 fill(0, 102);
 smooth();
 noStroke();
 }
 
 void draw() {  /*
Функция background() очищает окно полностью, поэтому убедитесь, что она
расположена перед другими функциями в блоке draw(), иначе фигуры,
нарисованные перед ней, будут стерты.
*/
 background(204);
 ellipse(mouseX, mouseY, 9,9); // координаты указвтеля мыши это координаты центра
                               // эллипса /точки
 }
 
