//---ex 05 20 -----пример---------------
/*
void setup() {
  size(240, 120);
  strokeWeight(12);
}

// разность скорости перемещения линии иллюзия что серая линия догоняет и обгоняет

void draw() {
  background(204);
  stroke(102);
  line(mouseX, 0, mouseX, height); // Gray line
  stroke(0);
  float mx = mouseX/2 + 60; //mouseX/2 половина от текущего положения мыши по оси X 
  line(mx, 0, mx, height); // Black line
}
*/

//---ex 05 21----пример---------Функция map()-----------------

//void setup() {
//  size(240, 120);
//  strokeWeight(12);
//}

//void draw() {
//  background(204);
//  stroke(102);
//  line(mouseX, 0, mouseX, height); // Gray line
//  stroke(0);
//  float mx = map(mouseX, 0, width, 60, 180);
//  line(mx, 0, mx, height); // Black line
//}

/*
Используйте функцию map(), чтобы взять любое число и масштабировать его до
нового числа, более полезного для проекта, над которым вы работаете. 
Например, используйте цифры из положения мыши, чтобы управлять размером 
или цветом фигуры. В этом примере координата x мыши (числа от 0 до 360) 
масштабируется до новых чисел, чтобы определить цвет и размер круга.




void setup() {
  size(640, 360);
  noStroke();
}

void draw() {
  background(0);
  //// Масштабируйте значение mouseX от 0 до 640 в диапазоне от 0 до 175
  float c = map(mouseX, 0, width, 0, 175);
// Масштабируйте значение mouseX от 0 до 640 в диапазоне от 40 до 300
  float d = map(mouseX, 0, width, 40, 300);
  fill(255, c, 0);
  ellipse(width/2, height/2, d, d);   
}
*/

void setup() {
  size(640, 360);
  noStroke();
}

void draw() {
  background(0);
  //// Масштабируйте значение mouseX от 0 до 640 в диапазоне от 0 до 175
  float c = map(mouseX, 0, width, 0, 175);
// Масштабируйте значение mouseX от 0 до 640 в диапазоне от 40 до 300
  float d = map(mouseX, 0, width, 40, 300);
  fill(255, c, 0);
  ellipse(width/2, height/2, d, d);   
}

/*
Повторно отображает число из одного диапазона в другой.

size(200, 200);
float value = 25;
float m = map(value, 0, 100, 0, width);
ellipse(m, 200, 10, 10);

В первом примере выше число 25 преобразуется из значения
в диапазоне от 0 до 100 в значение, которое находится в 
диапазоне от левого края окна (0) до правого края (ширина).

Как показано во втором примере, числа, выходящие за пределы 
диапазона, не привязываются к минимальным и максимальным 
значениям параметров, поскольку значения, выходящие за пределы 
диапазона, часто являются преднамеренными и полезными.

float value = 110;
float m = map(value, 0, 100, -20, -10);
println(m);  // Prints "-9.0"
*/

//void setup() {
//  size(200, 200);
//  noStroke();
//}

//void draw() {
//  background(204);
//  float  x1 = map(mouseX, 0, width, 50, 150);
//  ellipse(x1, 75, 50, 50);  
//  float x2 = map(mouseX, 0, width, 0, 200);
//  ellipse(x2, 125, 50, 50);  
//}

/*
Синтаксис map(value, start1, stop1, start2, stop2)

Параметры
value  (float)  входящее значение, подлежащее преобразованию

start1  (float)  нижняя граница текущего диапазона значений

stop1  (float)  верхняя граница текущего диапазона значений

start2  (float)  нижняя граница целевого диапазона значения

stop2  (float)  верхняя граница целевого диапазона значения

*/
